In [1]:
pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\kymani\anaconda3\lib\site-packages (2.9.6)Note: you may need to restart the kernel to use updated packages.

In [14]:
import psycopg2

In [15]:
import pandas as pd

In [16]:
conn = psycopg2.connect("dbname=myduka user=postgres password=1234")

In [17]:
conn

In [21]:
df = pd.read_sql_query("SELECT * FROM my_sales", conn)

C:\Users\Kymani\AppData\Local\Temp\ipykernel_9748\1059559552.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT * FROM my_sales", conn)

In [22]:
df

      id  pid  quantity                 created_at
0      1    1      45.0 2023-06-22 18:37:15.684384
1      2    2      34.0 2023-06-22 18:38:07.962995
2      3    4      89.0 2023-06-22 18:39:22.898928
3      4    3     567.0 2023-06-22 18:39:49.750845
4      5    1     576.0 2023-06-22 20:22:40.404530
..   ...  ...       ...                        ...
879  880   24     439.0 2022-07-08 00:00:00.000000
880  881   36     435.0 2022-08-04 00:00:00.000000
881  882    4     369.0 2022-09-04 00:00:00.000000
882  883   51     223.0 2022-10-15 00:00:00.000000
883  884   57      87.0 2022-09-03 00:00:00.000000

[884 rows x 4 columns]

In [32]:
df = pd.read_sql_query("SELECT * FROM myduka_sales",conn)

C:\Users\Kymani\AppData\Local\Temp\ipykernel_9748\407364595.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT * FROM myduka_sales",conn)

In [33]:
df = df.set_index('sales_id')

In [34]:
df

Empty DataFrame
Columns: [product_name, buying_price, selling_price, sale_quantity, created_at]
Index: []

In [1]:
temp_df = my_sales_df.append(my_sales_df)

NameError: name 'my_sales_df' is not defined

In [ ]:
temp.